Documents/А_ВыполнениеРаботМодулей.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ВыполнениеРаботМодулей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.А_ВыполнениеРаботМодулей</xr:Item>
				<xr:Item>InformationRegister.А_ПроцентыВыполненияМодулей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураСебестоимости</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.А_СтруктураСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМодулей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.А_ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерМодуля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланЧасыМодуля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыВыполнение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/А_ПроцентыВыполненияМодулей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_ПроцентыВыполненияМодулей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктураСебестоимости</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.А_СтруктураСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерМодуля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/А_СтруктураСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>А_СтруктураСебестоимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПроизводство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладМонтаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_КоличествоМодулей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗастосовуватиПеревіркуОдиниць</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДомов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ОбщиеНазванияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаВыезде</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеСовпадает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаВыезде</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/А_ВыполнениеРаботМодулей/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Форма документа А_ВыполнениеРаботМодулей.
// Матрица «работа x модули»: колонки М1..М_N создаются ПРОГРАММНО по КоличествуМодулей
// (эталон паттерна — УстановкаЗначенийНефинансовыхПоказателей: ИзменитьРеквизиты ->
// Элементы.Добавить -> УстановитьДействие). Хранение нормализовано в ТЧ Работы
// (строка = Работа x НомерМодуля), pivot/unpivot — при чтении/записи формы.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.СтруктураСебестоимости) Тогда
		ОбновитьПараметрыСтруктуры();
	КонецЕсли;

	Если Объект.КоличествоМодулей > 0 Тогда
		СоздатьКолонкиМатрицы();
		ЗаполнитьМатрицуИзРабот(Объект.Работы);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Матрица -> нормализованная ТЧ (писать в ТекущийОбъект, не в Объект!).
	ТекущийОбъект.Работы.Очистить();
	КоличествоМодулей = Макс(Объект.КоличествоМодулей, 1);
	Для Каждого СтрокаМатрицы Из Матрица Цикл
		ПланМодуля = СтрокаМатрицы.ПланЧасы / КоличествоМодулей;
		Для Н = 1 По КоличествоМодулей Цикл
			НоваяСтрока = ТекущийОбъект.Работы.Добавить();
			НоваяСтрока.Работа         = СтрокаМатрицы.Работа;
			НоваяСтрока.Этап           = СтрокаМатрицы.Этап;
			НоваяСтрока.НомерМодуля    = Н;
			НоваяСтрока.ПланЧасыМодуля = ПланМодуля;
			НоваяСтрока.Процент        = СтрокаМатрицы["М" + Н];
			НоваяСтрока.ЧасыВыполнение = ПланМодуля * НоваяСтрока.Процент / 100;
			НоваяСтрока.Комментарий    = СтрокаМатрицы.Комментарий;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// Платформа перечитала объект — восстановить матрицу из актуальной ТЧ.
	ЗаполнитьМатрицуИзРабот(ТекущийОбъект.Работы);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура СтруктураСебестоимостиПриИзменении(Элемент)

	СтруктураСебестоимостиПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура МатрицаПриИзменении(Элемент)

	ПересчитатьИтоги();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзСтруктуры(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.СтруктураСебестоимости) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Укажите структуру себестоимости'"));
		Возврат;
	КонецЕсли;
	ЗаполнитьИзСтруктурыНаСервере();
	ПересчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПредыдущему(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.СтруктураСебестоимости) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Укажите структуру себестоимости'"));
		Возврат;
	КонецЕсли;
	ЗаполнитьПоПредыдущемуНаСервере();
	ПересчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура Процентовать(Команда)

	Оповещение = Новый ОписаниеОповещения("ПроцентоватьЗавершение", ЭтотОбъект);
	ПоказатьВводЧисла(Оповещение, 100, НСтр("ru = 'Процент для выделенных работ (все модули)'"), 5, 2);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_МатрицаМодульПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Матрица.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПересчитатьСтрокуМатрицы(ТекущиеДанные);
	ПересчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ПроцентоватьЗавершение(Значение, ДополнительныеПараметры) Экспорт

	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыделенныеСтроки = Элементы.Матрица.ВыделенныеСтроки;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаМатрицы = Матрица.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если СтрокаМатрицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Н = 1 По Объект.КоличествоМодулей Цикл
			СтрокаМатрицы["М" + Н] = Значение;
		КонецЦикла;
		ПересчитатьСтрокуМатрицы(СтрокаМатрицы);
	КонецЦикла;
	ПересчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуМатрицы(СтрокаМатрицы)

	КоличествоМодулей = Макс(Объект.КоличествоМодулей, 1);
	СуммаПроцентов = 0;
	Для Н = 1 По КоличествоМодулей Цикл
		СуммаПроцентов = СуммаПроцентов + СтрокаМатрицы["М" + Н];
	КонецЦикла;
	СтрокаМатрицы.ЧасыВыполнение = СтрокаМатрицы.ПланЧасы / КоличествоМодулей * СуммаПроцентов / 100;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтоги()

	ИтогоПлан = 0;
	ИтогоВыполнение = 0;
	Для Каждого СтрокаМатрицы Из Матрица Цикл
		ИтогоПлан = ИтогоПлан + СтрокаМатрицы.ПланЧасы;
		ИтогоВыполнение = ИтогоВыполнение + СтрокаМатрицы.ЧасыВыполнение;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СтруктураСебестоимостиПриИзмененииНаСервере()

	ОбновитьПараметрыСтруктуры();
	// Пересоздание колонок: сохранить нечего при смене СС — матрица перезаполняется.
	СоздатьКолонкиМатрицы();
	Матрица.Очистить();
	ЗаполнитьИзСтруктурыНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыСтруктуры()

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СтруктураСебестоимости,
		"Подразделение, А_КоличествоМодулей");
	Объект.Подразделение = Реквизиты.Подразделение;
	Объект.КоличествоМодулей = Макс(Реквизиты.А_КоличествоМодулей, 1);

КонецПроцедуры

// Динамические колонки матрицы: снос старых по реестру + создание М1..М_N.
// Порядок строгий: элементы удаляются ДО реквизитов, реквизиты добавляются ДО элементов.
&НаСервере
Процедура СоздатьКолонкиМатрицы()

	// 1. Снос старых элементов и реквизитов (по реестру ДобавленныеКолонки).
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого ЭлементСписка Из ДобавленныеКолонки Цикл
		ИмяКолонки = ЭлементСписка.Значение;
		ЭлементФормы = Элементы.Найти("Матрица" + ИмяКолонки);
		Если ЭлементФормы <> Неопределено Тогда
			Элементы.Удалить(ЭлементФормы);
		КонецЕсли;
		УдаляемыеРеквизиты.Добавить("Матрица." + ИмяКолонки);
	КонецЦикла;
	ДобавленныеКолонки.Очистить();

	// 2. Новые реквизиты-колонки — ОДНИМ вызовом ИзменитьРеквизиты.
	КоличествоМодулей = Макс(Объект.КоличествоМодулей, 1);
	НовыеРеквизиты = Новый Массив;
	КвалификаторыПроцента = Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный);
	ОписаниеТипаПроцент = Новый ОписаниеТипов("Число", КвалификаторыПроцента);
	Для Н = 1 По КоличествоМодулей Цикл
		НовыеРеквизиты.Добавить(Новый РеквизитФормы("М" + Н, ОписаниеТипаПроцент, "Матрица", "М" + Н));
	КонецЦикла;
	ИзменитьРеквизиты(НовыеРеквизиты, УдаляемыеРеквизиты);

	// 3. Элементы-колонки (после ИзменитьРеквизиты) + обработчик.
	Для Н = 1 По КоличествоМодулей Цикл
		НовыйЭлемент = Элементы.Добавить("МатрицаМ" + Н, Тип("ПолеФормы"), Элементы.Матрица);
		НовыйЭлемент.ПутьКДанным = "Матрица.М" + Н;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "М" + Н;
		НовыйЭлемент.Ширина = 5;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_МатрицаМодульПриИзменении");
		ДобавленныеКолонки.Добавить("М" + Н);
	КонецЦикла;

	// Порядок: М-колонки между «План, год» и «Виконання, год».
	Для Н = 1 По КоличествоМодулей Цикл
		Элементы.Переместить(Элементы["МатрицаМ" + Н], Элементы.Матрица, Элементы.МатрицаЧасыВыполнение);
	КонецЦикла;

КонецПроцедуры

// ТЧ Работы (нормализованная) -> матрица формы. Колонки уже созданы.
&НаСервере
Процедура ЗаполнитьМатрицуИзРабот(КоллекцияРабот)

	Матрица.Очистить();
	СоответствиеСтрок = Новый Соответствие;
	Для Каждого СтрокаРабот Из КоллекцияРабот Цикл
		СтрокаМатрицы = СоответствиеСтрок.Получить(СтрокаРабот.Работа);
		Если СтрокаМатрицы = Неопределено Тогда
			СтрокаМатрицы = Матрица.Добавить();
			СтрокаМатрицы.Работа = СтрокаРабот.Работа;
			СтрокаМатрицы.Этап = СтрокаРабот.Этап;
			СтрокаМатрицы.Комментарий = СтрокаРабот.Комментарий;
			СоответствиеСтрок.Вставить(СтрокаРабот.Работа, СтрокаМатрицы);
		КонецЕсли;
		СтрокаМатрицы.ПланЧасы = СтрокаМатрицы.ПланЧасы + СтрокаРабот.ПланЧасыМодуля;
		СтрокаМатрицы.ЧасыВыполнение = СтрокаМатрицы.ЧасыВыполнение + СтрокаРабот.ЧасыВыполнение;
		Если СтрокаРабот.НомерМодуля >= 1 И СтрокаРабот.НомерМодуля <= Объект.КоличествоМодулей Тогда
			СтрокаМатрицы["М" + СтрокаРабот.НомерМодуля] = СтрокаРабот.Процент;
		КонецЕсли;
	КонецЦикла;
	ПересчитатьИтогиНаСервере();

КонецПроцедуры

// Работы и план из А_СтруктураСебестоимости.Работы (свертка по работе; введённые проценты сохраняются).
&НаСервере
Процедура ЗаполнитьИзСтруктурыНаСервере()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СС", Объект.СтруктураСебестоимости);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Р.Работа КАК Работа,
	|	МАКСИМУМ(Р.Этап) КАК Этап,
	|	СУММА(Р.Количество) КАК ПланЧасы
	|ИЗ
	|	Справочник.А_СтруктураСебестоимости.Работы КАК Р
	|ГДЕ
	|	Р.Ссылка = &СС
	|СГРУППИРОВАТЬ ПО
	|	Р.Работа";

	СтарыеПроценты = Новый Соответствие;
	Для Каждого СтрокаМатрицы Из Матрица Цикл
		Проценты = Новый Массив;
		Для Н = 1 По Объект.КоличествоМодулей Цикл
			Проценты.Добавить(СтрокаМатрицы["М" + Н]);
		КонецЦикла;
		СтарыеПроценты.Вставить(СтрокаМатрицы.Работа, Проценты);
	КонецЦикла;

	Матрица.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаМатрицы = Матрица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаМатрицы, Выборка);
		Проценты = СтарыеПроценты.Получить(Выборка.Работа);
		Если Проценты <> Неопределено Тогда
			Для Н = 1 По Объект.КоличествоМодулей Цикл
				СтрокаМатрицы["М" + Н] = Проценты[Н - 1];
			КонецЦикла;
		КонецЕсли;
		ПересчитатьСтрокуМатрицыНаСервере(СтрокаМатрицы);
	КонецЦикла;
	ПересчитатьИтогиНаСервере();

КонецПроцедуры

// Перенос процентов из предыдущего снимка (срез РС, исключая сам документ).
&НаСервере
Процедура ЗаполнитьПоПредыдущемуНаСервере()

	Если Матрица.Количество() = 0 Тогда
		ЗаполнитьИзСтруктурыНаСервере();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СС", Объект.СтруктураСебестоимости);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент", Объект.Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	П.Работа КАК Работа,
	|	П.НомерМодуля КАК НомерМодуля,
	|	МАКСИМУМ(П.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_МаксПериод
	|ИЗ
	|	РегистрСведений.А_ПроцентыВыполненияМодулей КАК П
	|ГДЕ
	|	П.СтруктураСебестоимости = &СС
	|	И П.Регистратор <> &Ссылка
	|	И П.Период <= &Момент
	|СГРУППИРОВАТЬ ПО
	|	П.Работа,
	|	П.НомерМодуля
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	П.Работа КАК Работа,
	|	П.НомерМодуля КАК НомерМодуля,
	|	МАКСИМУМ(П.Процент) КАК Процент
	|ИЗ
	|	РегистрСведений.А_ПроцентыВыполненияМодулей КАК П
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксПериод КАК М
	|		ПО П.Работа = М.Работа
	|			И П.НомерМодуля = М.НомерМодуля
	|			И П.Период = М.Период
	|ГДЕ
	|	П.СтруктураСебестоимости = &СС
	|	И П.Регистратор <> &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	П.Работа,
	|	П.НомерМодуля";

	СтрокиПоРаботе = Новый Соответствие;
	Для Каждого СтрокаМатрицы Из Матрица Цикл
		СтрокиПоРаботе.Вставить(СтрокаМатрицы.Работа, СтрокаМатрицы);
	КонецЦикла;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаМатрицы = СтрокиПоРаботе.Получить(Выборка.Работа);
		Если СтрокаМатрицы = Неопределено
			ИЛИ Выборка.НомерМодуля < 1
			ИЛИ Выборка.НомерМодуля > Объект.КоличествоМодулей Тогда
			Продолжить;
		КонецЕсли;
		СтрокаМатрицы["М" + Выборка.НомерМодуля] = Выборка.Процент;
	КонецЦикла;

	Для Каждого СтрокаМатрицы Из Матрица Цикл
		ПересчитатьСтрокуМатрицыНаСервере(СтрокаМатрицы);
	КонецЦикла;
	ПересчитатьИтогиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокуМатрицыНаСервере(СтрокаМатрицы)

	КоличествоМодулей = Макс(Объект.КоличествоМодулей, 1);
	СуммаПроцентов = 0;
	Для Н = 1 По КоличествоМодулей Цикл
		СуммаПроцентов = СуммаПроцентов + СтрокаМатрицы["М" + Н];
	КонецЦикла;
	СтрокаМатрицы.ЧасыВыполнение = СтрокаМатрицы.ПланЧасы / КоличествоМодулей * СуммаПроцентов / 100;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтогиНаСервере()

	ИтогоПлан = 0;
	ИтогоВыполнение = 0;
	Для Каждого СтрокаМатрицы Из Матрица Цикл
		ИтогоПлан = ИтогоПлан + СтрокаМатрицы.ПланЧасы;
		ИтогоВыполнение = ИтогоВыполнение + СтрокаМатрицы.ЧасыВыполнение;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
